$(".d1").on("click", function () {
  $(".d1").html("吉岡道");
});
$(".f1").on("click", function () {
  $(".f1").html("谷口ツキ子");
});
$(".h1").on("click", function () {
  $(".h1").html("川村喜代江");
});
$(".i1").on("click", function () {
  $(".i1").html("松本進章");
});
$(".j1").on("click", function () {
  $(".j1").html("濱田治子");
});
$(".n1").on("click", function () {
  $(".n1").html("沖見梅野");
});
$(".b").on("click", function () {
  alert(
    "1994年香川県高松市生まれ。高松高-中央大-都内人材会社/Forbes Japanオフィシャルコラムニスト。"
  );
});
$(".c").on("click", function () {
  alert(
    "1969年大阪府寝屋川市生まれ。中村高-法政大-大手百貨店。高校時代は陸上部でインターハイ出場"
  );
});
$(".d").on("click", function () {
  alert(
    "1968年高知県土佐清水市生まれ。中村高-昭和女子大-大阪教育大学。日本語教師や国語教師などを歴任。"
  );
});
$(".e").on("click", function () {
  alert(
    "1942年高知県幡多郡三崎村生まれ。3歳で戦争孤児となり、親族を転々。大工として独り立ちして谷村左官創業。"
  );
});
$(".f").on("click", function () {
  alert(
    "1944年宮崎県串間市生まれ。パチンコが尋常になく強く、形見もパチンコ玉で、我が家では勝負事の際にこの形見をポケットに忍ばせる"
  );
});
$(".g").on("click", function () {
  alert(
    "1931年高知県幡多郡月灘村生まれ。中村高-横浜国立大学-教員。陸上部と吹奏楽部と空手部を兼任していた猛者。"
  );
});
$(".h").on("click", function () {
  alert(
    "1938年高知県長岡郡本山町生まれ。幼少期は北京で育ち、敗戦で引き上げ。叔父は初代高知県知事。"
  );
});
$(".i").on("click", function () {
  alert(
    "1923年高知県生まれ。海軍に入隊し、1944年8月のグアム島防衛戦において玉砕"
  );
});
$(".j").on("click", function () {
  alert("1919年高知県生まれ。2人の子どもを授かるが、1944年に若くして病没");
});
$(".k").on("click", function () {
  alert("詳細調査中");
});
$(".l").on("click", function () {
  alert("詳細調査中");
});
$(".m").on("click", function () {
  alert(
    "1894年高知県生まれ。宝石珊瑚や漁業で生計を立てていた。高齢になってもするすると木を登るほど元気で、80歳を超えてから、「これからは自動車の時代だ」といって運転免許を取得しようとして家族に止められたエピソードがある"
  );
});
$(".n").on("click", function () {
  alert(
    "1902年高知県生まれ。実家の沖見家は宝石珊瑚で大変豊かだったという。また、養父である吉岡寅吉は西南戦争に従軍していたという伝承があり、寅吉・さくは養父母ではなく本当は実の両親だという伝承がある"
  );
});
$(".o").on("click", function () {
  alert("詳細不明。");
});
$(".p").on("click", function () {
  alert("詳細不明");
});

$(".i").hide();
$(".j").hide();
$(".k").hide();
$(".l").hide();
$(".m").hide();
$(".n").hide();
$(".o").hide();
$(".p").hide();
$(".i1").hide();
$(".j1").hide();
$(".k1").hide();
$(".l1").hide();
$(".m1").hide();
$(".n1").hide();
$(".o1").hide();
$(".p1").hide();

$(".q").on("click", function () {
  $(".i").show();
  $(".j").show();
  $(".i1").show();
  $(".j1").show();
});
$(".r").on("click", function () {
  $(".k").show();
  $(".l").show();
  $(".k1").show();
  $(".l1").show();
});
$(".s").on("click", function () {
  $(".m").show();
  $(".n").show();
  $(".m1").show();
  $(".n1").show();
});
$(".t").on("click", function () {
  $(".o").show();
  $(".p").show();
  $(".o1").show();
  $(".p1").show();
});
